CALMING_EXERCISE_TEXT = (
    "Давай попробуем технику <b>5-4-3-2-1</b>, чтобы вернуться в настоящий момент.\n\n"
    "• Назови <b>5 вещей</b>, которые ты видишь вокруг себя.\n"
    "• Назови <b>4 звука</b>, которые ты слышишь.\n"
    "• Назови <b>3 ощущения</b> в теле (например, касание одежды, поверхность под ногами).\n"
    "• Назови <b>2 запаха</b>, которые ты чувствуешь.\n"
    "• Назови <b>1 вещь</b>, которую ты можешь попробовать на вкус (или просто сделай глоток воды).\n\n"
    "Сделай это медленно, в своем темпе. Когда закончишь, нажми на кнопку ниже."
)

# BLACKPILL_METHOD
BLACKPILL_EXIT_TEXT = (
    "⚫ Режим “Выход из блекпилла” сделан для того, чтобы ты переключил свои комплексы —— на уважение к себе и развитии себя.\n\n"
    "— Ты готов?"
)
BLACKPILL_AFTER_READY_TEXT_1 = (
    "⚫ С какими жизненными проблемами ты столкнулся из-за блекпилл?"
)
BLACKPILL_AFTER_READY_TEXT_2 = (
    "⚫ Расскажи, почему тебе сложно принять себя?"
)
BLACKPILL_AFTER_READY_TEXT_3 = (
    "⚫ Скажи, как на тебя повлиял блекпилл?"
)
BLACKPILL_AFTER_READY_TEXT_ARRAY = [
    BLACKPILL_AFTER_READY_TEXT_1,
    BLACKPILL_AFTER_READY_TEXT_2,
    BLACKPILL_AFTER_READY_TEXT_3,
]

HELP_TEXT = (
    "<b>🤖 Чем я могу помочь?</b>\n\n"
    "Я — ваш личный помощник для поддержки ментального здоровья. Моя цель — помочь вам разобраться в своих мыслях и чувствах.\n\n"
    "<b>Основные функции:</b>\n\n"
    "💬 <b>Начать диалог</b>\n"
    "Расскажите мне, что вас беспокоит. Я задам уточняющие вопросы, чтобы помочь вам взглянуть на ситуацию под другим углом.\n\n"
    "💡 <b>Методы поддержки</b>\n"
    "Если не знаете, с чего начать, воспользуйтесь техниками самопомощи:\n"
    # "• <b>Успокоиться:</b> дыхательные упражнения для снятия стресса.\n"
    "• <b>Высказаться:</b> безопасное пространство, чтобы выговориться.\n"
    # "• <b>КПТ-дневник:</b> отслеживайте свои мысли и эмоции.\n\n" 
    "• <b>Решение-проблемы:</b> советы или решения ваших проблем.\n\n"
    "⭐️ <b>Подписка</b>\n"
    "Оформите подписку, чтобы получить доступ к расширенным функциям, включая глубокий анализ и персональные отчеты.\n\n"
    "Для навигации можете использовать клавиатуру ниже или команды."
)

PROFILE_TEXT = (
    "<b>👤 О себе</b>\n\n"
    "<b>ID:</b> <code>{user_id}</code>\n"
    "<b>Никнейм:</b> @{username}\n"
    "<b>Тип подписки:</b> {subscription_type}"
)

SUBSCRIPTION_MENU_TEXT = (
    "<b>⭐️ Управление подпиской</b>\n\n"
    "Выберите подходящий для вас план и раскройте весь потенциал бота! 🚀\n\n"
    "👑 <b>Стандарт</b> — базовый набор функций для ежедневной поддержки.\n"
    "💎 <b>Pro</b> — все возможности без ограничений, включая продвинутые техники и персональные отчеты.\n\n"
    "Выберите подписку, чтобы узнать больше: 👇"
)

STANDARD_SUB_DETAIL_TEXT = (
    "<b>👑 Подписка \"Стандарт\"</b>\n\n"
    "Что вы получите:\n"
    "✅ Неограниченное количество диалогов\n"
    "✅ Доступ ко всем базовым техникам поддержки\n"
    "✅ Сохранение истории диалогов\n\n"
    "Выберите срок подписки:"
)

PRO_SUB_DETAIL_TEXT = (
    "<b>💎 Подписка \"Pro\"</b>\n\n"
    "Все из \"Стандарт\" плюс:\n"
    "🚀 Продвинутые методики (глубокий анализ КПТ, работа с целями)\n"
    "📊 Еженедельные отчеты о вашем прогрессе\n"
    "💌 Приоритетная поддержка\n\n"
    "Выберите срок подписки:"
)
